programming/creating-keygen.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Creating a simple keygen</title>
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png">
<link rel="stylesheet" type="text/css" href="../css/main.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Creating a simple keygen</h1>
<p>
<a href="../index.html">Index</a> | <a href="index.html">Up</a>
</p>

<hr />

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#brief-warning">1. Brief warning</a></li>
<li><a href="#what-is-a-keygen">2. What is a keygen?</a>
<ul>
<li><a href="#types-of-license-keys">2.1. Types of license keys</a></li>
</ul>
</li>
<li><a href="#things-to-avoid-when-making-the-function">3. Things to avoid when making the function</a>
<ul>
<li><a href="#generating-similar-keys-for-similar-users">3.1. Generating similar keys for similar users</a></li>
<li><a href="#making-the-user-and-the-key-lengths-proportional">3.2. Making the user and the key lengths proportional</a></li>
<li><a href="#collisions">3.3. Collisions</a></li>
</ul>
</li>
<li><a href="#the-key-generation-function">4. The key generation function</a></li>
<li><a href="#validating-a-user-login">5. Validating a user login</a></li>
<li><a href="#other-resources">6. Other resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-brief-warning" class="outline-2">
<h2 id="brief-warning"><span class="section-number-2">1.</span> Brief warning</h2>
<div class="outline-text-2" id="text-brief-warning">
<p>
I am not an expert on cryptography, so this article should be interpreted as
just some notes about keygens, written by someone who hasn't worked on
real-world keygens. I was just interested on the topic, and decided to write
about it. Don't rely to hard on the information in this article.
</p>
</div>
</div>

<div id="outline-container-what-is-a-keygen" class="outline-2">
<h2 id="what-is-a-keygen"><span class="section-number-2">2.</span> What is a keygen?</h2>
<div class="outline-text-2" id="text-what-is-a-keygen">
<p>
From Wikipedia:
</p>

<blockquote>
<p>
A <b>key generator</b> (<b>key-gen</b>) is a computer program that generates a product
licensing key, such as a serial number, necessary to activate for use of a
software application. Keygens may be legitimately distributed by software
manufacturers for licensing software [&#x2026;], or they may be developed and
distributed illegitimately in circumstances of copyright infringement or
software piracy.
</p>
</blockquote>

<p>
Note that in this article we are <b>not</b> going to reverse an existing keygen, but
instead create our own program that generates and validates keys for users. If
you are interested in reversing, I recommend you first read <a href="../reversing/reversing-keygen.html">Reversing a simple
keygen</a>.
</p>

<p>
Many programs use the internet to validate the keys, which obviously has some
advantages, but in our case we are going to validate them locally.
</p>
</div>

<div id="outline-container-types-of-license-keys" class="outline-3">
<h3 id="types-of-license-keys"><span class="section-number-3">2.1.</span> Types of license keys</h3>
<div class="outline-text-3" id="text-types-of-license-keys">
<p>
First of all, I am not an expert on this area, so feel free to <a href="https://github.com/8dcc/8dcc.github.io">contribute</a> to
this blog if you have any suggestions. For more information about types of
licenses, see <a href="https://keygen.sh/docs/choosing-a-licensing-model/">keygen.sh</a>.
</p>

<p>
We could use two main formats for the license keys:
</p>

<ol class="org-ol">
<li><b>Username is embedded in the key</b>: The user doesn't need to introduce his user,
as it's already embedded in the key. We would need to validate if the key is
valid, and extract (decode) the username from it. This is not the case on
most commercial products since, as I mentioned, they use the internet to get
the user associated to that key from a remote database.</li>
<li><b>Log-in with a username</b>: The user needs to provide his username, and the key
will be checked against it. A key is only valid when comparing it against its
username.</li>
</ol>

<p>
Depending on the format, we would have two ways of validating the input key. For
the first one, we would have to <b>apply the <a href="https://en.wikipedia.org/wiki/Inverse_function">inverse function</a> of the algorithm</b> to
the provided key to validate it and get the username. For the second one, we
could just <b>encode the username again</b> to generate the key, and see if it matches
with the key provided by the user.
</p>

<p>
The second validation method I explained is basically what it's used to validate
passwords against the hashes in a database when a user tries to log-in, but the
key difference is that, although <a href="https://en.wikipedia.org/wiki/Cryptographic_hash_function">hashing</a> can't be reverted, we are <a href="https://en.wikipedia.org/wiki/Code">encoding</a> the
username. The hashing algorithm used to generate a hash is not enough to revert
it (since it's a one-way algorithm), but <b>the algorithm used to encode a key is
the only thing needed to decode it</b>.
</p>

<p>
Since the goal here is to keep it simple, we will be using the second method for
our program, although it's not very secure since the encoding algorithm is
embedded in the program itself, and it can be easily reversed. We are going to
make a simple key generation function, and an application that uses it to
validate an input key from the user.
</p>
</div>
</div>
</div>

<div id="outline-container-things-to-avoid-when-making-the-function" class="outline-2">
<h2 id="things-to-avoid-when-making-the-function"><span class="section-number-2">3.</span> Things to avoid when making the function</h2>
<div class="outline-text-2" id="text-things-to-avoid-when-making-the-function">
<p>
When generating a program like this, it's a good idea to asume that there is
going to be someone attempting to reverse our program and figure out how our key
generation algorithm works.
</p>

<p>
Here are some things we should try to avoid when making the function.
</p>
</div>

<div id="outline-container-generating-similar-keys-for-similar-users" class="outline-3">
<h3 id="generating-similar-keys-for-similar-users"><span class="section-number-3">3.1.</span> Generating similar keys for similar users</h3>
<div class="outline-text-3" id="text-generating-similar-keys-for-similar-users">
<p>
Imagine our algorithm just turned each letter of the name to its position in the
alphabet. The user <code>abcd</code> would generate the key <code>1234</code>.
</p>

<p>
If we generated the key for the user <code>abzd</code>, only the third character would
change, which would tell the person trying to reverse our algorithm that there
is a direct relationship between each character in the input and each character
in the key.
</p>

<p>
His problem transforms from "how did this string turn into this other string"
into "how did this character turn into this other character", which is obviously
easier to find.
</p>
</div>
</div>

<div id="outline-container-making-the-user-and-the-key-lengths-proportional" class="outline-3">
<h3 id="making-the-user-and-the-key-lengths-proportional"><span class="section-number-3">3.2.</span> Making the user and the key lengths proportional</h3>
<div class="outline-text-3" id="text-making-the-user-and-the-key-lengths-proportional">
<p>
Imagine we had the algorithm from the last example. The user is also able to
tell that the lengths of the strings are proportional, for example:
</p>

<pre class="example" id="org994b29d">
abcd  -&gt; 1234
abcde -&gt; 12345
ab    -&gt; 12
</pre>

<p>
This is not ideal, since it gives even more information to the person trying to
reverse our program.
</p>

<p>
Our key should have a fixed number of characters, independently of the length of
the user. Here are some examples on what to avoid, assuming our key length is
9:
</p>

<pre class="example" id="orgf63b9b6">
abcd       -&gt; 123400000 (Same as previous example)
abcd       -&gt; 123412341 (Repetition is easy to tell)
abcdefghij -&gt; 123456789 (Last character is ignored, produces same output as abcdefghi)
</pre>
</div>
</div>

<div id="outline-container-collisions" class="outline-3">
<h3 id="collisions"><span class="section-number-3">3.3.</span> Collisions</h3>
<div class="outline-text-3" id="text-collisions">
<p>
In cryptography, a <a href="https://en.wikipedia.org/wiki/Collision_resistance">collision</a> is produced when two different inputs produce the
same output. This is a problem when hashing, since one of the basic properties
of hashes is that they should produce unique outputs.
</p>

<p>
In our case, we should try to avoid collisions as much as possible, but I won't
be focusing on this too much on this article.
</p>
</div>
</div>
</div>
