programming/creating-keygen.org
* The key generation function
:PROPERTIES:
:CUSTOM_ID: the-key-generation-function
:END:

This is a simple keygen function I came up with, but it's far from perfect so
feel free to contribute with a better version, as I said above.

The first loop is used to indicate how many times we want to apply the user to
the key. This is arbitrary, I used =KEY_KEN+1=, but it should be at least
=ceil(KEY_LEN/user_len)=.

The second loop is used to iterate the user itself. First, it scrambles the bit
pairs and bits just like in [[file:../reversing/challenge2.org][challenge 2]]. We then multiply the character in the
previous position by the current iteration number (of the outer loop), and we
XOR the current character by that number. Lastly, we XOR the character by the
length of the user. We do this just to add even more variation to the final
output. We can then store this character for the next iteration, and write it to
the =out= pointer.

#+begin_src C
#include <stdint.h>
#include <string.h>

#define KEY_LEN 20

static void generate_key(const char* user, uint8_t* out) {
    const int user_len = strlen(user);

    int key_pos          = 0;
    unsigned char last_c = 0;

    /* Iterate the user KEY_LEN+1 times */
    for (int iter = 0; iter < KEY_LEN + 1; iter++) {
        /* Iterate the user */
        for (int user_pos = 0; user[user_pos] != '\0'; user_pos++) {
            unsigned char c = user[user_pos];

            /* Swap every bit pair with the adjactent pair */
            c = ((c & 0x33333333) << 2) | ((c & 0xCCCCCCCC) >> 2);

            /* Swap every bit with the adjactent one */
            c = ((c & 0x55555555) << 1) | ((c & 0xAAAAAAAA) >> 1);

            /* Also change depending on previous char and iteration */
            c ^= (last_c * iter) % 0xFF;

            /* Depending on the length of the input, change the output */
            c ^= user_len & 0xFF;

            /* Save current character for next iteration */
            last_c = c;

            /* Write the char to the current position */
            out[key_pos++] = c;

            /* Don't overflow the key */
            if (key_pos >= KEY_LEN)
                key_pos = 0;
        }
    }
}
#+end_src

This is an example of a simple keygen program:

#+begin_src C
#include <stdio.h>

int main(int argc, char** argv) {
    if (argc < 2) {
        fprintf(stderr, "Usage: %s <username>\n", argv[0]);
        return 1;
    }

    const char* username = argv[1];
    uint8_t key[KEY_LEN] = { 0 };

    generate_key(username, key);

    printf("%s : ", username);
    for (int i = 0; i < KEY_LEN; i++)
        printf("%02x", key[i]);
    putchar('\n');

    return 0;
}
#+end_src

