programming/creating-keygen.html

<div id="outline-container-the-key-generation-function" class="outline-2">
<h2 id="the-key-generation-function"><span class="section-number-2">4.</span> The key generation function</h2>
<div class="outline-text-2" id="text-the-key-generation-function">
<p>
This is a simple keygen function I came up with, but it's far from perfect so
feel free to contribute with a better version, as I said above.
</p>

<p>
The first loop is used to indicate how many times we want to apply the user to
the key. This is arbitrary, I used <code>KEY_KEN+1</code>, but it should be at least
<code>ceil(KEY_LEN/user_len)</code>.
</p>

<p>
The second loop is used to iterate the user itself. First, it scrambles the bit
pairs and bits just like in <a href="../reversing/challenge2.html">challenge 2</a>. We then multiply the character in the
previous position by the current iteration number (of the outer loop), and we
XOR the current character by that number. Lastly, we XOR the character by the
length of the user. We do this just to add even more variation to the final
output. We can then store this character for the next iteration, and write it to
the <code>out</code> pointer.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6740;">#include</span> <span style="color: #00d3d0;">&lt;stdint.h&gt;</span>
<span style="color: #ff6740;">#include</span> <span style="color: #00d3d0;">&lt;string.h&gt;</span>

<span style="color: #ff6740;">#define</span> <span style="color: #6ae4b9;">KEY_LEN</span> <span style="color: #88ca9f;">20</span>

<span style="color: #ff6f9f;">static</span> <span style="color: #79a8ff;">void</span> <span style="color: #4ae2ff;">generate_key</span>(<span style="color: #ff6f9f;">const</span> <span style="color: #79a8ff;">char</span>* <span style="color: #6ae4b9;">user</span>, <span style="color: #79a8ff;">uint8_t</span>* <span style="color: #6ae4b9;">out</span>) {
    <span style="color: #ff6f9f;">const</span> <span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">user_len</span> = strlen(user);

    <span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">key_pos</span>          = <span style="color: #88ca9f;">0</span>;
    <span style="color: #79a8ff;">unsigned</span> <span style="color: #79a8ff;">char</span> <span style="color: #6ae4b9;">last_c</span> = <span style="color: #88ca9f;">0</span>;

    <span style="color: #989898;">/* </span><span style="color: #989898;">Iterate the user KEY_LEN+1 times</span><span style="color: #989898;"> */</span>
    <span style="color: #ff6f9f;">for</span> (<span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">iter</span> = <span style="color: #88ca9f;">0</span>; iter &lt; KEY_LEN + <span style="color: #88ca9f;">1</span>; iter++) {
        <span style="color: #989898;">/* </span><span style="color: #989898;">Iterate the user</span><span style="color: #989898;"> */</span>
        <span style="color: #ff6f9f;">for</span> (<span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">user_pos</span> = <span style="color: #88ca9f;">0</span>; user[user_pos] != <span style="color: #00d3d0;">'\0'</span>; user_pos++) {
            <span style="color: #79a8ff;">unsigned</span> <span style="color: #79a8ff;">char</span> <span style="color: #6ae4b9;">c</span> = user[user_pos];

            <span style="color: #989898;">/* </span><span style="color: #989898;">Swap every bit pair with the adjactent pair</span><span style="color: #989898;"> */</span>
            c = ((c &amp; <span style="color: #88ca9f;">0x33333333</span>) &lt;&lt; <span style="color: #88ca9f;">2</span>) | ((c &amp; <span style="color: #88ca9f;">0xCCCCCCCC</span>) &gt;&gt; <span style="color: #88ca9f;">2</span>);

            <span style="color: #989898;">/* </span><span style="color: #989898;">Swap every bit with the adjactent one</span><span style="color: #989898;"> */</span>
            c = ((c &amp; <span style="color: #88ca9f;">0x55555555</span>) &lt;&lt; <span style="color: #88ca9f;">1</span>) | ((c &amp; <span style="color: #88ca9f;">0xAAAAAAAA</span>) &gt;&gt; <span style="color: #88ca9f;">1</span>);

            <span style="color: #989898;">/* </span><span style="color: #989898;">Also change depending on previous char and iteration</span><span style="color: #989898;"> */</span>
            c ^= (last_c * iter) % <span style="color: #88ca9f;">0xFF</span>;

            <span style="color: #989898;">/* </span><span style="color: #989898;">Depending on the length of the input, change the output</span><span style="color: #989898;"> */</span>
            c ^= user_len &amp; <span style="color: #88ca9f;">0xFF</span>;

            <span style="color: #989898;">/* </span><span style="color: #989898;">Save current character for next iteration</span><span style="color: #989898;"> */</span>
            last_c = c;

            <span style="color: #989898;">/* </span><span style="color: #989898;">Write the char to the current position</span><span style="color: #989898;"> */</span>
            out[key_pos++] = c;

            <span style="color: #989898;">/* </span><span style="color: #989898;">Don't overflow the key</span><span style="color: #989898;"> */</span>
            <span style="color: #ff6f9f;">if</span> (key_pos &gt;= KEY_LEN)
                key_pos = <span style="color: #88ca9f;">0</span>;
        }
    }
}
</pre>
</div>

<p>
This is an example of a simple keygen program:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6740;">#include</span> <span style="color: #00d3d0;">&lt;stdio.h&gt;</span>

<span style="color: #79a8ff;">int</span> <span style="color: #4ae2ff;">main</span>(<span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">argc</span>, <span style="color: #79a8ff;">char</span>** <span style="color: #6ae4b9;">argv</span>) {
    <span style="color: #ff6f9f;">if</span> (argc &lt; <span style="color: #88ca9f;">2</span>) {
        fprintf(stderr, <span style="color: #00d3d0;">"Usage: %s &lt;username&gt;\n"</span>, argv[<span style="color: #88ca9f;">0</span>]);
        <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">1</span>;
    }

    <span style="color: #ff6f9f;">const</span> <span style="color: #79a8ff;">char</span>* <span style="color: #6ae4b9;">username</span> = argv[<span style="color: #88ca9f;">1</span>];
    <span style="color: #79a8ff;">uint8_t</span> <span style="color: #6ae4b9;">key</span>[KEY_LEN] = { <span style="color: #88ca9f;">0</span> };

    generate_key(username, key);

    printf(<span style="color: #00d3d0;">"%s : "</span>, username);
    <span style="color: #ff6f9f;">for</span> (<span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">i</span> = <span style="color: #88ca9f;">0</span>; i &lt; KEY_LEN; i++)
        printf(<span style="color: #00d3d0;">"%02x"</span>, key[i]);
    putchar(<span style="color: #00d3d0;">'\n'</span>);

    <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">0</span>;
}
</pre>
</div>
</div>
</div>
