programming/creating-keygen.html

<div id="outline-container-validating-a-user-login" class="outline-2">
<h2 id="validating-a-user-login"><span class="section-number-2">5.</span> Validating a user login</h2>
<div class="outline-text-2" id="text-validating-a-user-login">
<p>
We could use the previous keygen program to generate a key for each user, and
use that to log-in. In this case we will be using the same <code>generate_key</code> function
for comparing the real key with the provided one. This is obviously not ideal,
and we should use <b>at least</b> the inverse function of <code>generate_key</code>.
</p>

<p>
I made these two function for reading the key from the user. The first one just
converts a hexadecimal character to its corresponding <a href="https://en.wikipedia.org/wiki/Nibble">nibble</a> (group of 4 bits).
</p>

<p>
The second one reads the user input into a local buffer using <code>scanf</code>. The maximum
length of the string should be <code>KEY_LEN*2+1</code> since every byte takes up 2
characters, and we need an extra space for the null terminator. We iterate each
character of the string and, for each pair, we OR the higher nibble (after
shifting) with the lower one.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6740;">#include</span> <span style="color: #00d3d0;">&lt;stdio.c&gt;</span>

<span style="color: #989898;">/* </span><span style="color: #989898;">(KEY_LEN * 2) + '\0'</span><span style="color: #989898;"> */</span>
<span style="color: #ff6740;">#define</span> <span style="color: #6ae4b9;">STR_KEY_LEN</span> <span style="color: #88ca9f;">41</span>

<span style="color: #989898;">/* </span><span style="color: #989898;">'f' -&gt; 15</span><span style="color: #989898;"> */</span>
<span style="color: #ff6f9f;">static</span> <span style="color: #ff6f9f;">inline</span> <span style="color: #79a8ff;">int8_t</span> <span style="color: #4ae2ff;">char2nibble</span>(<span style="color: #79a8ff;">char</span> <span style="color: #6ae4b9;">c</span>) {
    <span style="color: #ff6f9f;">if</span> (c &gt;= <span style="color: #00d3d0;">'0'</span> &amp;&amp; c &lt;= <span style="color: #00d3d0;">'9'</span>)
        <span style="color: #ff6f9f;">return</span> c - <span style="color: #00d3d0;">'0'</span>;
    <span style="color: #ff6f9f;">else</span> <span style="color: #ff6f9f;">if</span> (c &gt;= <span style="color: #00d3d0;">'a'</span> &amp;&amp; c &lt;= <span style="color: #00d3d0;">'f'</span>)
        <span style="color: #ff6f9f;">return</span> c - <span style="color: #00d3d0;">'a'</span> + <span style="color: #88ca9f;">10</span>;
    <span style="color: #ff6f9f;">else</span> <span style="color: #ff6f9f;">if</span> (c &gt;= <span style="color: #00d3d0;">'A'</span> &amp;&amp; c &lt;= <span style="color: #00d3d0;">'F'</span>)
        <span style="color: #ff6f9f;">return</span> c - <span style="color: #00d3d0;">'A'</span> + <span style="color: #88ca9f;">10</span>;
    <span style="color: #ff6f9f;">else</span>
        <span style="color: #ff6f9f;">return</span> -<span style="color: #88ca9f;">1</span>;
}

<span style="color: #ff6f9f;">static</span> <span style="color: #79a8ff;">void</span> <span style="color: #4ae2ff;">read_key</span>(<span style="color: #79a8ff;">uint8_t</span>* <span style="color: #6ae4b9;">out</span>) {
    <span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">out_pos</span> = <span style="color: #88ca9f;">0</span>;

    <span style="color: #79a8ff;">char</span> <span style="color: #6ae4b9;">key</span>[STR_KEY_LEN] = { <span style="color: #88ca9f;">0</span> };
    scanf(<span style="color: #00d3d0;">"%41s"</span>, key);

    <span style="color: #989898;">/* </span><span style="color: #989898;">"3f5d" -&gt; { 0x3f, 0x5d }</span><span style="color: #989898;"> */</span>
    <span style="color: #ff6f9f;">for</span> (<span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">i</span> = <span style="color: #88ca9f;">0</span>; key[i] != <span style="color: #00d3d0;">'\0'</span>; i++) {
        <span style="color: #989898;">/* </span><span style="color: #989898;">First half of the byte: '3' -&gt; 3</span><span style="color: #989898;"> */</span>
        <span style="color: #79a8ff;">int8_t</span> <span style="color: #6ae4b9;">nibble</span> = char2nibble(key[i]);
        <span style="color: #ff6f9f;">if</span> (nibble == -<span style="color: #88ca9f;">1</span>)
            <span style="color: #ff6f9f;">break</span>;
        out[out_pos] = nibble;

        i++;
        <span style="color: #ff6f9f;">if</span> (key[i] == <span style="color: #00d3d0;">'\0'</span>)
            <span style="color: #ff6f9f;">break</span>;

        <span style="color: #989898;">/* </span><span style="color: #989898;">Move previous bits to higher half of byte</span><span style="color: #989898;"> */</span>
        out[out_pos] &lt;&lt;= <span style="color: #88ca9f;">4</span>;

        <span style="color: #989898;">/* </span><span style="color: #989898;">Second half of the byte: 'f' -&gt; 15</span><span style="color: #989898;"> */</span>
        nibble = char2nibble(key[i]);
        <span style="color: #ff6f9f;">if</span> (nibble == -<span style="color: #88ca9f;">1</span>)
            <span style="color: #ff6f9f;">break</span>;
        out[out_pos] |= nibble;

        out_pos++;
    }
}
</pre>
</div>

<p>
The <code>main</code> function just reads an username with <code>scanf</code>, a key with our <code>read_key</code>,
and we generate the real key with <code>generate_key</code>. We compare the two with a simple
loop, and store if they match.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6740;">#include</span> <span style="color: #00d3d0;">&lt;stdbool.h&gt;</span>

<span style="color: #79a8ff;">int</span> <span style="color: #4ae2ff;">main</span>(<span style="color: #79a8ff;">void</span>) {
    printf(<span style="color: #00d3d0;">"Username: "</span>);
    <span style="color: #79a8ff;">char</span> <span style="color: #6ae4b9;">user</span>[<span style="color: #88ca9f;">255</span>] = { <span style="color: #88ca9f;">0</span> };
    scanf(<span style="color: #00d3d0;">"%255s"</span>, user);

    printf(<span style="color: #00d3d0;">"Key: "</span>);
    <span style="color: #79a8ff;">uint8_t</span> <span style="color: #6ae4b9;">user_key</span>[KEY_LEN] = { <span style="color: #88ca9f;">0</span> };
    read_key(user_key);

    <span style="color: #79a8ff;">uint8_t</span> <span style="color: #6ae4b9;">real_key</span>[KEY_LEN] = { <span style="color: #88ca9f;">0</span> };
    generate_key(user, real_key);

    <span style="color: #79a8ff;">bool</span> <span style="color: #6ae4b9;">match</span> = <span style="color: #88ca9f;">true</span>;
    <span style="color: #ff6f9f;">for</span> (<span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">i</span> = <span style="color: #88ca9f;">0</span>; i &lt; KEY_LEN; i++)
        <span style="color: #ff6f9f;">if</span> (user_key[i] != real_key[i])
            match = <span style="color: #88ca9f;">false</span>;

    <span style="color: #ff6f9f;">if</span> (match)
        puts(<span style="color: #00d3d0;">"Correct key."</span>);
    <span style="color: #ff6f9f;">else</span>
        puts(<span style="color: #00d3d0;">"Invalid key."</span>);

    <span style="color: #ff6f9f;">return</span> <span style="color: #88ca9f;">0</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-other-resources" class="outline-2">
<h2 id="other-resources"><span class="section-number-2">6.</span> Other resources</h2>
<div class="outline-text-2" id="text-other-resources">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Keygen">Keygen wikipedia page</a></li>
<li><a href="https://github.com/bitcookies/winrar-keygen/blob/master/README.HOW_DOES_IT_WORK.md">WinRAR key generation algorithm explained</a>.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
